Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་བས་ན་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ་ཞེས་བྱ་བའི་ཚིག་འདི་ལ། དེ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པ་ཞེས་པ་ཞེས་བྱ་བའི་ཚིག་བཟུང་སྟེ། དུས་ཞེས་བྱ་བ་དང་། གསུམ་ཞེས་བྱ་བ་དང་།
en: That is why ‘Great Vehicle’ is said,” speaking about “time,” “three,” “equal,” and “vehicle” separately, it eliminates “time” with “the past time period is empty of the past time period,” and so on.

source: མཉམ་པ་ཞེས་བྱ་བ་དང་། ཐེག་པ་ཞེས་བྱ་བ་སོ་སོར་སྨོས་ནས། འདས་པའི་དུས་ཀྱང་འདས་པའི་དུས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་དུས་སེལ་ལོ། །དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱང་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ནི་མཉམ་པ་ཞེས་བྱ་བས་སེལ་ཏོ།
en: It eliminates “equal” with “the equality of the three time periods is also empty of the equality of the three time periods.”

source: །ཐེག་པ་ཆེན་པོ་ཡང་ཐེག་པ་ཆེན་པོས་སྟོང་ངོ་ཞེས་བྱ་བས་ནི་ཐེག་པ་སེལ་ཏོ།
en: It eliminates “vehicle” with “the Great Vehicle is also empty of the Great Vehicle.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་ཞེས་བྱ་བས་ནི། སྐབས་ནས་སྨོས་པའི་བྱང་ཆུབ་སེམས་དཔས་སེལ་ཏོ།
en: It eliminates the bodhisattva being talked about in this part of the text with “the bodhisattva is also empty of the bodhisattva.”

source: །རབ་འབྱོར་སྟོང་པ་ཉིད་ལ་གཅིག་ཅེས་བྱ་བ་མེད་དོ། །གཉིས་སམ་གསུམ་མམ་ཞེས་བྱ་བ་ནས། བཅུ་ཞེས་བྱ་བའི་བར་དུ་མེད་དོ་ཞེས་བྱ་བས་ནི་གྲངས་ཀྱི་ཚིག་སེལ་ཏོ།
en: It eliminates words for numbers with “Subhūti, in emptiness there is no one, or two, or three,” up to “ten.”

source: །དེ་བས་ན་འདི་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པའོ་ཞེས་བྱ་བས་མཇུག་བསྡུས་ཏེ་བསྟན་པ་ཅི་ལས་དགོངས་ཤེ་ན།
en: Summing up in conclusion by saying, “Therefore, this is a vehicle… equally of the three time periods,” what does that intend?

source: དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པ་ཞེས་བྱ་བ་ནི་མཐར་ཐུག་པའི་ཐེག་པ་ཆེན་པོ་ལ་བྱའོ། །ཐེག་པ་ཆེན་པོ་ཡང་ཐ་དད་དུ་བྱ་བ་ཐམས་ཅད་དང་བྲལ་བས། གཅིག་པུའི་བདག་ཉིད་དེ།
en: Take “vehicle equally of the three time periods” as the final Great Vehicle, a Great Vehicle that is, in its nature, one alone because it is free of all differentiation.

source: དེ་ལ་ནི་དུས་ཞེས་བྱ་བ་དང་། དུས་མཉམ་པ་ཉིད་ཅེས་བྱ་བ་དང་། ཐེག་པ་ཆེན་པོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ཐམས་ཅད་སྟོང་པ་ཉིད་ཙམ་དུ་ཟད་པའི་ཐེག་པའོ།
en: In it, “time,” “the equality of time,” “Great Vehicle,” and “bodhisattva” are all just simply emptiness.

source: །སྟོང་པ་ཉིད་ཙམ་དུ་ཟད་པ་དེ་ལ་ནི་ཀུན་བརྟགས་པའི་ཆོས་དེ་དག་མེད་པའི་ཕྱིར་ཐམས་ཅད་སེལ་ཏོ།
en: It eliminates them all, because “in this” all falsely imagined dharmas are nonexistent.

source: །དེ་ལྟར་བསྩལ་ནས་ཀྱང་ཐམས་ཅད་གཅིག་གི་བདག་ཉིད་དུ་འགྱུར་བའི་ཕྱིར། དེ་བས་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པ་སྟེ་ཞེས་བྱ་བ་ཐམས་ཅད་ཀྱི་མཇུག་བསྡུས་སོ།
en: Even having thus eliminated them, because all are, in their nature, one, it sums it all up in conclusion with, “Therefore, this is the vehicle of the bodhisattva great beings equally of the three time periods.”

source: །དེ་ལྟར་མདོར་བསྡུས་ཏེ་བསྟན་ནས། ཐེག་པ་ཆེན་པོ་འདི་ལ་མཉམ་པ་དང་། མི་མཉམ་པ་ནི་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པས་སྤྲོས་ཏེ་ཡན་ལག་ཐམས་ཅད་སེལ་ཏོ།
en: Having thus taught in brief, it gives a detailed explanation with, “In this Great Vehicle you cannot apprehend same or not the same,” and so on, eliminating all the branches. “

source: །མཉམ་པ་དང་མི་མཉམ་པ་ཉིད་ཐ་དད་པའོ།
en: Same, or not the same,” that is to say, different.

source: །འདོད་ཆགས་དང་འདོད་ཆགས་བྲལ་བ་ཡང་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལ། འདོད་ཆགས་ནི་མི་མཉམ་པའོ། །འདོད་ཆགས་དང་བྲལ་བ་ནི་མཉམ་པའོ་ཞེས་བྱ་བར་སྦྱར་རོ།
en: As for, “you cannot apprehend greed or free from greed,” and so on, connect “greed” with “not the same,” and “free from greed” with “same.”

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་གཉིས་ཀྱི་ངོ་བོར་མེད་པར་བསྟན་ནས། རབ་འབྱོར་འདས་པའི་གཟུགས་ནི་འདས་པའི་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པས། ཡང་སོ་སོའི་མིང་སྨོས་ཏེ་མེད་པར་བསྟན་ཏོ།
en: Having thus taught that all the dharmas are not, as entities, two, with “a past form, Subhūti, is empty of a past form,” and so on, it names each separately and teaches that they do not exist. “

source: །སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པས་དམིགས་སུ་མེད་ན།
en: Given that you cannot apprehend even emptiness because it is empty of emptiness, how could you ever apprehend a past form in emptiness?”

source: སྟོང་པ་ཉིད་ལ་འདས་པའི་གཟུགས་དམིགས་པར་ལྟ་ག་ལ་འགྱུར་ཞེས་བྱ་བ་ལ་གཟུགས་སྟོང་པ་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་གཟུགས་དང་འབྲེལ་བའི་སྟོང་པ་ཉིད་སྨོས་པ་དེའི་ཚེ་སྟོང་པ་དེ་ཉིད་ཀྱང་ཀུན་བརྟགས་པ་ཡིན་པའི་ཕྱིར་ཡོད་པ་མ་ཡིན་ན་སྟོང་པ་ཉིད་དེ་ལ་གཟུགས་ཡོད་པར་གཟུགས་ལ་འགྱུར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means “given that” when you describe an emptiness connected to form, as in “form is empty,” even that very emptiness is also falsely imagined and does not exist, “how could” there “ever” be “a form in” that “emptiness”?

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱང་། དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་པར་བསྟན་ནས། མཉམ་པ་ཉིད་ཀྱང་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ན་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན།
en: Having taught that “you cannot apprehend” the dharmas— “the perfection of giving” and so on— “in the equality” of the three periods of time, what does is intend by “given that you cannot apprehend even equality in the equality…”?

source: མཐར་ཐུག་པའི་ཐེག་པ་ཆེན་པོའི་ས་ལ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་ཆོས་ཐམས་ཅད་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་གྱུར་ནས། སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རྗེས་སུ་ཞུགས་ཏེ། དེ་བས་ན་དེ་ལ་དུས་གསུམ་མཉམ་པ་ཉིད་ཅེས་བྱ་བ་ཡང་མེད་ལ། དུས་གསུམ་དུ་གཏོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་ཡང་མེད་དོ།
en: At the level of the final Great Vehicle, all dharmas—the perfection of giving and so on—are in the nature of maturations and are fully engaged with emptiness, so even “the equality of the three periods of time” does not exist there, and the perfection of giving and so on included in the three periods of time do not exist either.

source: །དེའི་ཕྱིར། མཉམ་པ་ཉིད་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམིགས་པར་ག་ལ་འགྱུར་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “how could you ever apprehend the past, future, and present perfection of giving in the equality?”

source: །དེ་བཞིན་དུ་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ། །འགྲེས་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་བསྩལ་བའི་འགྲེས་དང་།
en: Similarly, connect this with them all.

source: ཆོས་ཐམས་ཅད་གཉིས་ཀྱི་སྒོ་ནས་བསྩལ་བའི་འགྲེས་དང་། ཕུང་པོ་ལྔའི་ཆོས་རྣམས་ལ་དུས་གསུམ་བསྩལ་བའི་འགྲེས་དང་། སྟོང་པ་ཉིད་ལ་དུས་གསུམ་དུ་གཏོགས་པའི་ཕུང་པོ་ལྔའི་ཆོས་རྣམས་བསྩལ་བའི་འགྲེས་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྩལ་བའི་འགྲེས་དང་། དེ་དག་ལ་སྟོང་པ་ཉིད་བསྩལ་བའི་འགྲེས་དང་། དེ་དག་ཉིད་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སོགས་པ་མ་འདྲེས་པའི་མཐར་ཐུག་པའི་བར་དག་བསྩལ་བའི་འགྲེས་དང་། སོ་སོ་སྐྱེ་བོ་བསྩལ་བའི་འགྲེས་དང་། ཉན་ཐོས་དང་།
en: As for the subsections of this passage, they should be understood as: the section eliminating the equality of the three time periods;the section eliminating all dharmas based on pairs;the section eliminating the three time periods in the five aggregate dharmas;the section eliminating the five aggregate dharmas included in the three time periods in emptiness;the section eliminating the six perfections in the equality of the three time periods;the section eliminating emptiness in that [equality];the section eliminating the applications of mindfulness and so on, up to, finally, the distinct attributes of a buddha in just that [equality];the section eliminating an ordinary person; andthe section eliminating śrāvakas, pratyekabuddhas, bodhisattvas, and tathāgatas. “

source: རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་བསྩལ་བའི་འགྲེས་རྣམས་སུ་ཤེས་པར་བྱའོ། །དེ་བས་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ་ཞེས་བྱ་བ་ནི་ཆེན་པོ་རྣམས་ཀྱི་ཐེག་པ་ཡིན་པས་ཐེག་པ་ཆེན་པོ་ཞེས་བྱ་བར་ངེས་པའི་ཚིག་གིས་བསྟན་ཏོ།
en: Therefore, it is the Great Vehicle of the bodhisattva great beings.”

source: །བཅོམ་ལྡན་འདས་གནས་བརྟན་རབ་འབྱོར་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སླད་དུ་བསྒོ་བ་མཛད་པས་འདི་ནི་ཐེག་པ་ཆེན་པོ་བསྟན་པར་སེམས་སོ་ཞེས་བྱ་བ་ནི་གནས་བརྟན་གང་པོས་འོག་ནས་བཤད་པའི་སྐབས་དབྱེ་བའི་ཕྱིར་གསོལ་པའོ།
en: It explains through a creative etymology that because it is the vehicle of the great ones it is the Great Vehicle. The remaining sixteen questions The elder Pūrṇa, setting the scene for what is going to be discussed next, says: “Lord, tasked with the perfection of wisdom… this elder Subhūti thinks he has to give instruction in the Great Vehicle.”

source: །སྔར་གདམས་པ་དང་། རྗེས་སུ་བསྟན་པ་བཤད་པ་རྩོམ་པ་ལས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩམས་ཏེ། ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་འབྱུང་བར་འགྱུར་བར་སྤོབས་པར་གྱིས་ཤིག་ཅེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར་བསྐོས་ལ།
en: Earlier, at the start of the explanation of advice and instruction, “The Lord said to venerable Subhūti, ‘Subhūti, … be confident in your readiness to give a Dharma discourse to the bodhisattva great beings about how bodhisattva great beings go forth in the perfection of wisdom.’ ”

source: ད་ལྟར་ནི་ཐེག་པ་ཆེན་པོ་བཤད་པ་བྱས་པ་ལས་ཞུས་པ་ནི་དེའི་སྒོ་ནས་འོག་ནས་བཤད་པའི་ལམ་འདོད་དོ།
en: He tasked him with the perfection of wisdom. Now [Pūrṇa’s] statement, prompted by Subhūti’s explanation of the Great Vehicle, wants, by means of that, to introduce the path that is going to be discussed next. “

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་འགལ་བར་ཐེག་པ་ཆེན་པོ་བསྟན་པའམ་གཅིག་ཏུ་མ་གྱུར་ལགས་གྲང་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གཉིས་ཐ་མི་དད་པའི་ཕྱིར། ཐེག་པ་ཆེན་པོ་བསྟན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་བསྟན་པ་ཡིན་པར་དགོངས་པ་སྟེ།
en: Let it not be the case, Lord, that I am giving instruction in the Great Vehicle, having violated the perfection of wisdom” intends that the two—the perfection of wisdom and the Great Vehicle—are not different, so, by teaching the Great Vehicle, he has also taught the perfection of wisdom as well.

source: ཐེག་པ་ཆེན་པོ་བསྟན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པར་འགྱུར་རོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པས་ཐེག་པ་ཆེན་པོ་བསྟན་པར་འགྱུར་རོ་ཞེས་ཐ་མའི་ཚིག་བསྟན་ཏོ།
en: So, it will make the statement at the end that “by giving instruction in the Great Vehicle you have given instruction in the perfection of wisdom, and by giving instruction in the perfection of wisdom you have given instruction in the Great Vehicle.”

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཚིག་བཅུས། འོག་ནས་བཤད་པའི་ས་བོན་གྱི་ཚིག་རྣམས་བསྟན་ཏོ།
en: The ten statements— “Lord, one does not apprehend a bodhisattva at the prior limit,” and so on—teach the seed statements that are going to be discussed below.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་བྱུང་བ་དང་། ཕྱིས་འབྱུང་བ་དང་། ད་ལྟར་ཡང་ཡོད་དོ་ཞེས་དུས་གསུམ་ལ་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པར་བསྟན་ཏོ།
en: Among them, “one does not apprehend a bodhisattva at the prior limit” teaches that one does not apprehend a bodhisattva in the three time periods: one that existed before, that will exist in the future, or that exists now.

source: །གང་གི་ཕྱིར་མཐའ་གསུམ་པོ་འདི་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པ་དེའི་ཕྱིར་མཐའ་མེད་པས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཐའ་ཐུག་པ་མེད་པར་བསྟན་ནས།
en: One does not apprehend a bodhisattva at these three limits, so one is limitless.

source: དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་གཟུགས་ཀུན་དུ་མཐའ་ཡས་པའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་མཐའ་ཡས་པར་རིག་པར་བགྱིའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: Therefore, having taught that a bodhisattva has no limits, it next says, “Lord, one has to know the limitlessness of a bodhisattva through the limitlessness of form,” and so on.

source: གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ལ་མཐའ་གསུམ་མེད་པས་ཀུན་དུ་མཐའ་ཡས་པ་ཉིད་དེ། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཀུན་དུ་མཐའ་ཡས་པར་རིག་པར་བྱའོ། །ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that one should know that all dharmas, “form” and so on, do not have the three limits so they are in a limitless state; a bodhisattva is similarly limitless.

source: །གལ་ཏེ་གཟུགས་ལ་སོགས་པ་ཀུན་དུ་མཐའ་ཡས་པར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་མཐའ་ཡས་པ་ཞེས་བྱ་ན། འོ་ན་ནི་གཟུགས་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་རོ་སྙམ་པ་ལ། གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་དེ་ལྟ་བུ་ཡང་མ་མཆིས། མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: To someone who has the idea, “When one says that because form and so on are limitless a bodhisattva is limitless, well then, form and so on would become a bodhisattva,” it says, “Lord, even such an idea as ‘form is a bodhisattva’ does not exist and is not found,” and so on.

source: །དེ་ལྟར་དུས་གསུམ་ལ་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པས་གཟུགས་ལ་སོགས་པ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ངོ་བོར་མི་དམིགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་སུ་མེད་དོ།
en: Because one cannot apprehend a bodhisattva in the three periods of time one cannot apprehend a bodhisattva entity in form and so on, so a bodhisattva cannot be found.

source: །དེ་མི་དམིགས་པས་གདམས་པ་དང་། རྗེས་སུ་བསྟན་པ་གཉིས་ཀྱང་མེད་དོ།
en: Because one cannot be found, the two, “advice and instruction,” do not exist either. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མ་དམིགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་སྔར་བསྟན་པའི་དོན་ཉིད་བསྟན་ཏོ།
en: So, Lord, I, who thus do not find a bodhisattva great being as anyone at all in any way at all,” and so on, is a teaching with just the meaning as the earlier teaching. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་འདི་ནི་མིང་ཙམ་དུ་བས་སོ་ཞེས་བྱ་བས་ནི་དེ་ལྟར་དམིགས་སུ་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་བརྟགས་པ་ཙམ་དུ་ཟད་པར་སྟོན་ཏོ།
en: You say this, Lord, that is, ‘bodhisattva.’ It is just a word.” This is teaching that because bodhisattvas cannot be, they are simply just imaginary.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དོན་དམ་པར་མེད་པར་བསྟན་ནས་དཔེ་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན་བདག་བདག་ཅེས་བགྱི་བ་ཡང་། བདག་ནི་ཤིན་ཏུ་མངོན་པར་གྲུབ་པ་མ་མཆིས་པའོ་ཞེས་གསུངས་སོ།
en: Having thus taught that ultimately a bodhisattva does not exist, to give an example it says, “To illustrate, Lord, you say ‘self’ again and again, but it has absolutely not come into being.”

source: །དེ་ལྟར་བསྟན་ནས་དེའི་འོག་ཏུ་གཟུགས་ལ་སོགས་པ་མངོན་པར་འགྲུབ་པའི་མཚན་ཉིད་དང་། མངོན་པར་འགྲུབ་པ་མེད་པའི་མཚན་ཉིད་དེ་གཉི་ག་ཡང་མེད་པར་བསྟན་ཏེ།
en: Having taught like that, next it teaches that form and so on, both marked by coming into being and marked by not coming into being, do not exist.

source: དེ་ལ་མངོན་པར་འགྲུབ་པའི་མཚན་ཉིད་མེད་པ་ནི་བཅོམ་ལྡན་འདས་དེ་ལྟར་རང་བཞིན་དངོས་པོ་མ་མཆིས་པའི་ཆོས་རྣམས་ལ་གང་མངོན་པར་འགྲུབ་པའི་གཟུགས་དེ་གང་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་སྟེ།
en: Among them, about the nonexistence of the mark of coming into being, it says, “Lord, given that all phenomena thus have no intrinsic nature, what is that form that has come into being?”

source: གཟུགས་ལ་སོགས་པ་ནི་སྒྱུ་མ་ལྟ་བུ་ཡིན་པས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་།
en: and so on. Form and so on are like an illusion, so they have nonexistence and nonproduction for their nature.

source: མ་སྐྱེས་པའི་ཕྱིར་མངོན་པར་འགྲུབ་པའི་མཚན་ཉིད་མེད་དོ།
en: Hence, they are not marked by coming into being.

source: །དེའི་འོག་ཏུ་མངོན་པར་འགྲུབ་པ་མེད་པའི་མཚན་ཉིད་མེད་པ་བསྟན་པའི་ཕྱིར། གང་མངོན་པར་གྲུབ་པ་དེ་ནི་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: After that, in order to teach the nonexistence of the mark of not coming into being, it says, “Lord, what has come into being is not form,” and so on.

source: མངོན་པར་འགྲུབ་པ་མེད་པའི་མཚན་ཉིད་ནི་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ཡིན་གྱི། ཀུན་བརྟགས་པའི་གཟུགས་ལ་སོགས་པ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: What it means is the mark of not coming into being is the mark of the thoroughly established; it is not falsely imagined form and so on.

source: །དེ་ལྟར་ཀུན་བརྟགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མེད་པའི་ཕྱིར་གདམས་པའི་འོས་མ་ཡིན་པར་བསྟན་ནས། ད་ནི་དོན་དམ་པའི་ཆོས་ཉིད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་དབང་དུ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་མངོན་པར་མ་གྲུབ་པ་ལས་གུད་ན་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱོད་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་སུ་མ་མཆིས་ན། མངོན་པར་མ་གྲུབ་པ་མངོན་པར་གྲུབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའམ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: Having thus taught that because bodhisattvas are falsely imagined phenomena they are not suitable to be given advice, now, based on the bodhisattva who is the ultimate true nature of dharmas, it says, “Lord, you cannot apprehend those bodhisattva great beings who would practice for awakening other than those who have not come into being, so does what has not come into being give advice and instruction in a perfection of wisdom that has not come into being?”

source: དོན་དམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པས་མངོན་པར་མ་གྲུབ་པའི་མཚན་ཉིད་ཡིན་ཏེ། དེ་ཡང་སྤྲོས་པ་ཐམས་ཅད་ལས་འདས་པའི་ཕྱིར་གདམས་པ་དང་རྗེས་སུ་བསྟན་པའི་འོས་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: What this means is the ultimate bodhisattvas have the dharma-constituent as their intrinsic natures, so they are marked by not having come into being, and because they are beyond all thought construction it is not feasible to give them advice and instruction.

source: །དེ་ལྟར་དོན་དམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྟན་ནས། གལ་ཏེ་དེ་ལྟར་བསྟན་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཞུམ་པར་མི་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་རིག་པར་བགྱིའོ་ཞེས་བྱ་བས་ནི་དོན་དམ་པའི་སྤྱོད་པ་བསྟན་ཏོ།
en: Having thus taught the ultimate bodhisattva, with “one should know that when the mind of a bodhisattva given such instruction is not cowed… then that bodhisattva great being is practicing the perfection of wisdom,” it teaches the practice of the ultimate.

source: །འདི་མན་ཆད་ནི་སྔར་གླེངས་པ་ཉི་ཤུ་རྩ་དགུ་བཞག་པའི་ནང་ནས། རབ་འབྱོར་ཁྱོད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་རྗེས་སུ་མཐུན་པར་ཐེག་པ་ཆེན་པོ་སྟོན་ཏོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། གཏན་ལ་དབབ་པའི་ཚིག་བཅུ་གཉིས་བཀོད་པ་གང་ཡིན་པ་དེ་དག་ད་བསྟན་པར་བྱའོ། །བསྟན་ནས་ཀྱང་བཤད་པར་བྱའོ།
en: From here on, from among the twenty-nine questions and statements set forth earlier, taking “you are giving instruction in the Great Vehicle in harmony with the perfection of wisdom” as the point of departure, that array of twelve authoritative statements of specific instructions must now be taught, and having been taught, must also be explained. “

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སེམས་ཅན་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་དང་། དབུས་ཀྱི་མཐར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་གང་ཟག་ལ་བདག་མེད་པའི་ཕྱིར་ཏེ།
en: Venerable Śāriputra, because beings are nonexistent one does apprehend a bodhisattva at the prior limit… at the later limit… or in the middle” teaches that persons are without a self.

source: བྱང་ཆུབ་སེམས་དཔའ་འདས་པའི་དུས་ན་བྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་མ་འོངས་པ་ན་འབྱུང་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ད་ལྟར་བྱུང་བ་ན་ཡོད་དོ་ཞེས་བྱ་བ་དུས་གསུམ་དུ་ཉེ་བར་འགྲོ་བ་མེད་དོ་ཞེས་བྱ་བ་བསྟན་ཏོ།
en: Therefore, bodhisattvas did not exist at a time in the past, bodhisattvas will not exist at a time in the future, and bodhisattvas do not exist in the present time, and so “one does not come close to a bodhisattva” in the three periods of time.

source: །དེའི་འོག་ཏུ་གཟུགས་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཆོས་ལ་བདག་མེད་པ་བསྟན་ཏོ།
en: After that, “because form is nonexistent one cannot find a bodhisattva at the prior limit,” and so on, teaches that dharmas are selfless.

source: །འདི་དག་ཐམས་ཅད་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་དུ་ཐམས་ཅད་གཅིག་པར་དགོངས་པའོ།
en: They all “are not two, nor are they divided” intends that all are marked as thoroughly established so all are the same. “

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་ཉིད་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དུས་གསུམ་གྱི་དེ་བཞིན་ཉིད་དང་།
en: Venerable Śāriputra, because suchness is nonexistent one does not come close to a bodhisattva at the prior limit,” and so on. The suchness of the three periods of time and the suchness of a bodhisattva is falsely imagined and therefore does not exist.

source: བྱང་ཆུབ་སེམས་དཔའི་དེ་བཞིན་ཉིད་ཀུན་བརྟགས་པ་ཡིན་པའི་ཕྱིར་མེད་པའོ། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཅིའི་ཕྱིར་གཟུགས་ཀུན་དུ་མཐའ་ཡས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་མཐའ་ཡས་པར་རིག་པར་བྱ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཚིག་གཉིས་པ་བསྟན་ཏེ།
en: Why, Venerable Śāriputra, should one know the limitlessness of a bodhisattva through the limitlessness of form…?”

source: ཀུན་དུ་མཐའ་ཡས་པ་དེ་དག་གི་སྔོན་གྱི་མཐའ་ལ་སོགས་པ་མེད་པའི་ཕྱིར་རོ།
en: teaches the second statement, because there is no prior limit and so on of those that are not limited.

source: །ཚིག་གསུམ་པ་ལས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པ་ཆོས་ཉིད་ཀྱི་གཟུགས་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The third statement, “Venerable Śāriputra, form is empty of form,” means form that is the thoroughly established true dharmic nature is empty of the falsely imagined form.

source: །དེ་བས་ན་སྟོང་པ་ཉིད་ལ་གཟུགས་མེད་ཅེས་བྱ་བ་གསུངས་ཏེ། གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ལ་ཀུན་བརྟགས་པའི་གཟུགས་མེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, it says “in emptiness form does not exist,” which means a falsely imagined form does not exist in the emptiness of form.

source: །ཚིག་བཞི་པ་ལ། གཟུགས་ནི་གཟུགས་ལ་མི་དམིགས། གཟུགས་ནི་ཚོར་བ་ལ་མི་དམིགས་ཞེས་བྱ་བ་ལ་སོགས་པས་རང་གི་དངོས་པོ་དང་། གཞན་གྱི་དངོས་པོ་ལ་བཙལ་ན་ཆོས་ཐམས་ཅད་མི་དམིགས་པར་བསྟན་པ་སྟེ།
en: The fourth statement, “form is not found in form, form is not found in feeling,” and so on, teaches that you do not find any dharmas when you seek for them in their own intrinsic nature or in something else’s intrinsic nature.

source: འདིས་ནི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཞེས་བྱ་བ་བཤད་པ་ཡིན་ནོ།
en: This is explaining “as anyone at all in any way at all.”

source: །ཚིག་ལྔ་པ་ལ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་ནི་གློ་བུར་དུ་མིང་དུ་བཏགས་པ་ཞེས་བྱ་བ་ལ།
en: The fifth statement is “this—that is, ‘bodhisattva’—is a name plucked out of thin air.”

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་དོན་དམ་པ་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་ཡིན་ན་ཀུན་རྫོབ་ཏུ་དེ་ལ་ཐ་སྙད་དུ་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་གློ་བུར་དུ་བཏགས་པ་སྟེ།
en: Given that the nature of a bodhisattva is the emptiness of ultimate reality, conventionally, in order to give it a label, it is given the name “bodhisattva” plucked out of thin air. “

source: གློ་བུར་ཞེས་པ་ནི་ངོ་བོ་ཉིད་དུ་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Out of thin air” means not there intrinsically. “

source: །འདི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་མིང་ལྟར་ཕྱོགས་བཅུ་གང་ནས་ཀྱང་མི་འོང་གང་དུ་ཡང་མི་འགྲོ་ཞེས་བྱ་བས་ནི་ཡོད་པ་མ་ཡིན་པ་ཉིད་སྟོན་ཏོ།
en: Because the words for all dharmas do not come from anywhere in the ten directions and do not go anywhere” teaches that they do not exist.

source: །ཡང་དག་པར་སྐྱེ་བའི་དུས་ན་ཡང་གང་ནས་ཀྱང་མི་འོང་ལ། འགག་པའི་དུས་ན་ཡང་གང་དུ་ཡང་མི་འགྲོའོ།
en: In reality they “do not come from anywhere” when they arise and “do not go anywhere” when they stop.

source: །བྱང་ཆུབ་སེམས་དཔའི་མིང་འབའ་ཞིག་དེ་ལྟ་ཡིན་པར་མ་ཟད་ཀྱི། ཆོས་ཐམས་ཅད་ཀྱི་མིང་ཡང་འོང་བ་དང་འགྲོ་བ་མེད་པས་མེད་པར་བསྟན་ནས། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་གང་ནས་ཀྱང་མི་འོང་གང་དུ་ཡང་མི་འགྲོའོ་ཞེས་བྱ་བས་མཇུག་བསྡུས་ཏེ།
en: Having taught that not only is a bodhisattva just simply a name like that, but that all dharmas also do not come from anywhere and do not go anywhere, it sums up in conclusion with “so too the word for a bodhisattva does not come from anywhere and does not go anywhere.”

source: ཆོས་ཐམས་ཅད་ཀྱི་མིང་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་ལྟར་མིང་མེད་པར་བསྟན་ནས། འདི་ལྟར་གཟུགས་ཞེས་བྱ་བ་དང་།
en: This means “the words for all dharmas,” “a bodhisattva,” and also “the word for a bodhisattva” do not exist.

source: ཚོར་བ་ཞེས་བྱ་བ་དང་། འདུ་ཤེས་ཞེས་བྱ་བ་དང་། འདུ་བྱེད་ཅེས་བྱ་བ་དང་། རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་དག་ནི་མིང་དུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་མིང་དུ་ཟད་པར་བསྟན་ཏོ། །དེའི་འོག་ཏུ་འདི་ལྟར་གཟུགས་ཞེས་བྱ་བའི་མིང་དུ་བཏགས་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་སོགས་པ་དང་།
en: Having thus taught that words do not exist, with “because these—that is, ‘form,’ ‘feeling,’ ‘perception,’ ‘volitional factors,’ and ‘consciousness’—are simply just designated by names,” and so on, teaching that falsely imagined dharmas are simply words, it then, with thus “that name”— the designation ‘form’— “is not form,” and so on, teaches that the form and so on that is the true nature of dharmas, and those names, are not different.
